; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	image0 - mode
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Star9 image1)
	(have_image Planet10 image1)
	(have_image Planet11 image0)
	(have_image Planet12 image0)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 image1)
	(have_image Star15 image1)
	(have_image Planet16 image1)
	(have_image Star17 image0)
	(have_image Planet18 image0)
	(have_image Planet19 image0)
	(have_image Planet20 image0)
))

)

; plan
1. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 planet12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet12)
   goals met: 0 of 15
5. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 1 of 15
6. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 1 of 15
7. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 15
8. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 15
9. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 4 of 15
12. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 15
13. (take_image satellite0 phenomenon13 instrument0 image0)
   added: (have_image phenomenon13 image0)
   goals met: 5 of 15
14. (turn_to satellite0 planet16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet16)
   goals met: 5 of 15
15. (take_image satellite0 planet16 instrument0 image1)
   added: (have_image planet16 image1)
   goals met: 6 of 15
16. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 6 of 15
17. (take_image satellite0 planet18 instrument0 image0)
   added: (have_image planet18 image0)
   goals met: 7 of 15
18. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 7 of 15
19. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 8 of 15
20. (turn_to satellite0 planet20 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet20)
   goals met: 8 of 15
21. (take_image satellite0 planet20 instrument0 image0)
   added: (have_image planet20 image0)
   goals met: 9 of 15
22. (turn_to satellite0 planet7 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet7)
   goals met: 9 of 15
23. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 10 of 15
24. (turn_to satellite0 star15 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star15)
   goals met: 10 of 15
25. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 11 of 15
26. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 11 of 15
27. (take_image satellite0 star17 instrument0 image0)
   added: (have_image star17 image0)
   goals met: 12 of 15
28. (turn_to satellite0 star8 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star8)
   goals met: 12 of 15
29. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 13 of 15
30. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 13 of 15
31. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 14 of 15
32. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 15 of 15
